update to mermaid
